Repository: haitao-sjsu/VoiceBabel
Catalog: WhisperUtil/LogStrings.xcstrings
Source language: en
Languages: zh_hans

source: WhisperUtil starting...
zh_hans: WhisperUtil 启动中...

source: Log file path:
zh_hans: 日志文件路径:

source: Config:
zh_hans: 配置:

source: WhisperUtil started
zh_hans: WhisperUtil 已启动

source: WhisperKit model preload complete
zh_hans: WhisperKit 模型预加载完成

source: WhisperKit model preload failed:
zh_hans: WhisperKit 模型预加载失败:

source: Quit requested, currently idle, quitting now
zh_hans: 收到退出请求，当前空闲，立即退出

source: Quit requested, current state:
zh_hans: 收到退出请求，当前状态:

source: , waiting for completion...
zh_hans: ，等待完成后退出...

source: WhisperUtil quitting...
zh_hans: WhisperUtil 正在退出...

source: Processing complete, executing delayed quit
zh_hans: 处理完成，执行延迟退出

source: Settings: API mode changed to
zh_hans: 设置: API 模式切换为

source: Settings: Send mode changed to
zh_hans: 设置: 发送模式切换为

source: Settings: Delay changed to
zh_hans: 设置: 延迟时间切换为

source: Settings: Sound effects
zh_hans: 设置: 提示音

source: API Key cleared, network features unavailable
zh_hans: API Key 已清除，网络功能将不可用

source: API Key updated, services rebuilt, mode restored to
zh_hans: API Key 已更新，服务已重建，模式恢复为

source: API Key saved to Keychain
zh_hans: API Key 已保存到 Keychain

source: API Key save to Keychain failed
zh_hans: API Key 保存到 Keychain 失败

source: API Key cleared from Keychain
zh_hans: API Key 已从 Keychain 清除

source: RecordingController: current state
zh_hans: RecordingController: 当前状态

source: does not allow service update
zh_hans: 不允许更新服务

source: Cannot start recording, current state:
zh_hans: 无法开始录音，当前状态:

source: Processing in progress, please wait...
zh_hans: 正在处理中，请稍候...

source: User cancelled recording
zh_hans: 用户取消录音

source: User cancelled processing
zh_hans: 用户取消处理

source: speech-to-text
zh_hans: 语音转文字

source: speech translation
zh_hans: 语音翻译

source: local
zh_hans: 本地

source: cloud
zh_hans: 网络

source: Starting recording
zh_hans: 开始录音

source: Microphone occupied
zh_hans: 麦克风被占用

source: Recording start failed:
zh_hans: 录音启动失败:

source: WhisperKit model not ready
zh_hans: WhisperKit 模型未就绪

source: Stopping recording...
zh_hans: 停止录音...

source: No audio data recorded
zh_hans: 没有录到音频数据

source: Recording ended, data size:
zh_hans: 录音结束，数据大小:

source: Audio too short, ignoring
zh_hans: 音频太短，忽略

source: Audio volume too low
zh_hans: 音频音量太低

source: likely noise only, skipping recognition
zh_hans: 可能只有噪音，跳过识别

source: Calling Whisper API (cloud transcription)...
zh_hans: 正在调用 Whisper API（网络转录）...

source: Cloud speech recognition
zh_hans: 网络语音识别

source: Cloud API failed, falling back to local WhisperKit:
zh_hans: 网络 API 失败，尝试回退到本地 WhisperKit:

source: Fallback failed: no saved audio samples
zh_hans: 回退失败：没有保存的音频采样数据

source: Falling back to local WhisperKit, sample count:
zh_hans: 回退到本地 WhisperKit 转录，采样点数:

source: Entered network fallback mode, subsequent transcriptions will use local WhisperKit
zh_hans: 已进入网络回退模式，后续转录将使用本地 WhisperKit

source: Local fallback speech recognition
zh_hans: 本地回退语音识别

source: Local mode recording ended, sample count:
zh_hans: 本地模式录音结束，采样点数:

source: avg volume:
zh_hans: 平均音量:

source: Local speech recognition
zh_hans: 本地语音识别

source: audio duration
zh_hans: 音频时长

source: local processing timeout
zh_hans: 本地处理超时

source: result is empty
zh_hans: 结果为空

source: timed out
zh_hans: 超时

source: failed:
zh_hans: 失败:

source: Calling two-step translation (transcribe + GPT translate)...
zh_hans: 正在调用两步翻译（转录 + GPT 翻译）...

source: Speech translation (two-step)
zh_hans: 语音翻译(两步)

source: Calling Whisper API (direct translation)...
zh_hans: 正在调用 Whisper API（直接翻译）...

source: Speech translation
zh_hans: 语音翻译

source: User manually changed API mode, exiting fallback state
zh_hans: 用户手动切换 API 模式，退出回退状态

source: Network recovered, switching back to
zh_hans: 网络已恢复，切回

source: mode
zh_hans: 模式

source: result:
zh_hans: 结果:

source: Auto send: pressed Enter
zh_hans: 自动发送: 已按下 Enter

source: Delayed send: starting
zh_hans: 延迟发送: 开始

source: countdown...
zh_hans: 倒计时...

source: Delayed send: countdown ended, auto sent
zh_hans: 延迟发送: 倒计时结束，已自动发送

source: Delayed send: user pressed hotkey to cancel send, text preserved
zh_hans: 延迟发送: 用户按下热键取消发送，文本保留

source: Delayed send: user started new recording, cancelling send countdown
zh_hans: 延迟发送: 用户开始新录音，取消发送倒计时

source: Notification:
zh_hans: 通知:

source: Copy and paste last transcription:
zh_hans: 复制上次转写并粘贴:

source: Microphone in use by another program detected (Core Audio)
zh_hans: 检测到麦克风正被其他程序使用（Core Audio）

source: System dictation detected running
zh_hans: 检测到系统听写正在运行

source: Already recording
zh_hans: 已经在录音中

source: User denied microphone permission
zh_hans: 用户拒绝了麦克风权限

source: Recording stopped, duration:
zh_hans: 录音已停止，时长:

source: sample count:
zh_hans: 采样点数:

source: Audio conversion error:
zh_hans: 音频转换错误:

source: manual stop mode
zh_hans: 手动停止模式

source: Recording started
zh_hans: 录音已开始

source: Max recording duration reached
zh_hans: 已达到最长录音时间

source: auto stopping recording
zh_hans: 自动停止录音

source: LocalWhisper: loading model...
zh_hans: LocalWhisper: 正在加载模型...

source: LocalWhisper: model loaded
zh_hans: LocalWhisper: 模型加载完成

source: LocalWhisper: starting transcription, sample count:
zh_hans: LocalWhisper: 开始转录，采样点数:

source: duration:
zh_hans: 时长:

source: LocalWhisper: transcription result is empty
zh_hans: LocalWhisper: 转录结果为空

source: LocalWhisper: transcription complete:
zh_hans: LocalWhisper: 转录完成:

source: Two-step translation Step 1 complete, transcription result:
zh_hans: 两步翻译 Step 1 完成，转录结果:

source: NetworkHealthMonitor: starting Cloud API probe
zh_hans: NetworkHealthMonitor: 开始探测 Cloud API 可达性

source: NetworkHealthMonitor: stopped probing
zh_hans: NetworkHealthMonitor: 停止探测

source: NetworkHealthMonitor: Cloud API recovered
zh_hans: NetworkHealthMonitor: Cloud API 已恢复可达

source: Option key gesture monitoring started
zh_hans: Option 键手势监听已启动

source: Option key gesture monitoring stopped
zh_hans: Option 键手势监听已停止

source: ESC key detected
zh_hans: 检测到 ESC 键

source: Option double-tap detected
zh_hans: 检测到 Option 双击

source: Push-to-Talk ended (Option key released)
zh_hans: Push-to-Talk 结束（Option 键松开）

source: Push-to-Talk started (Option key held
zh_hans: Push-to-Talk 开始（Option 键按住

source: Option single-tap detected
zh_hans: 检测到 Option 单击
